import React from 'react';
import SimpleButton from "../UI/SimpleButton";

const startManeuvers = "- *Отход*(1) - Тратит 1 действие, все перемещения до конца хода не провоцируют атак, вы получаете -1МС на этот ход.\n" +
    "- *Засада*(1) - Тратит 2 действия. В следующий раз, когда вы попробуете напасть на противника, вы проходите соревнование Незаметность против Бдительности, при успехе противник считается Захваченным врасплох.\n" +
    "- *Оборона*(1) - Тратит 1 действие, вы получаете +1КФЗ и с преимуществом наносите провоцированные атаки. Любой щит(кроме баклера), даёт +1КФЗ в обороне. Заканчивает ход.\n" +
    "- *Борьба*(1) - Вы можете попытаться забороть противника, сбив его с ног, сместив на одну клетку, совершив Захват или попытаться сделать что-то ещё(на усмотрение мастера). Соревнование Атлетики против Атлетики/Акробатики противника(На его выбор). Захват стоит 2 действия, сбитие и смещение - 1. Владение умением Борьба позволяет использовать этот навык или защищаться от него с преимуществом."


const defaultCharacter = [
    [""],
    ["35"],
    ["28"],
    ["0"],
    ["6"],
    ["0"],
    ["1"],
    ["0","0","0","0","0","0"],
    ["0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0"],
    ["0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0"],
    ["Рюкзак, спальник, простая одежда, рацион на 5 дней"],
    ["0"],
    ["0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0"],
    [""],
    [""],
    [""],
    [""],
    [""],
    [""],
    ["0"],
    ["0"],
    ["150"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    ["0"],
    [startManeuvers],
    [""],
    [""],
    [""],
    [""],
]

const Loader = ({charList}) => {
    let JSONdata = JSON.stringify(Object.entries(charList).map((el) => el[1].value));
    let dataFile;

    function dumpCharacter(allData) {
        let blob1 = new Blob([allData], { type: "text/json;charset=utf-8" });

        let isIE = !!document.documentMode;
        if (isIE) {
            window.navigator.msSaveBlob(blob1, "Customers.txt");
        } else {
            let url = window.URL || window.webkitURL;
            let a = document.createElement("a");
            a.download = charList.charName.value[0] + ".txt";
            a.href = url.createObjectURL(blob1);
            document.body.appendChild(a);
            a.click();
            document.body.removeChild(a);
        }
    }

    async function downloadFile (file) {
        if(!file.target.files.length){
            return
        }
        const filesList = Array.from(file.target.files)
        const fileText = await filesList[0].text()
        dataFile = JSON.parse(fileText)

        file.target.files = [];
    }

    function dowloadCharacter (arrayData) {
        const setData = Object.entries(charList).map((el) => el[1].setArray);

        for (let i=0; i < arrayData.length; i++) {
            setData[i](arrayData[i]);
        }
    }

    function resetCharacter() {
        const ans = window.confirm("Вы уверены, что хотите сбросить персонажа?")
        if (ans) {
            const setData = Object.entries(charList).map((el) => el[1].setArray);
            for (let i=0; i < defaultCharacter.length; i++) {
                setData[i](defaultCharacter[i]);
            }
        }
    }

    return (
        <div className={"loader"}>
            <SimpleButton onClick={() => {dumpCharacter(JSONdata)}}>Сохранить персонажа</SimpleButton>
            <input type={"file"} onChange={downloadFile}/>
            <SimpleButton onClick={() => {dowloadCharacter(dataFile)}}>Загрузить персонажа</SimpleButton>
            <SimpleButton onClick={resetCharacter}>Сбросить персонажа</SimpleButton>
        </div>
    );
};

export default Loader;